{
	"blogs": [
		{
			"title": "How To Use Statusbrew Reporting To Measure Your ROI From Social Media?",
			"author": "Rohit Sharma",
			"content": "Are you curious to know what is the role of ROI (Return on Investment) in Social Media? And why it is important to measure the Social Media ROI for your business? Generally, If you ask this question to marketers, they all will give you different answers that increases your doubt instead of clearing it. However, they all agree on one thing that social media channels are capable of bringing enormous leads & traffic for websites that would eventually convert into customers.",
			"published": "2018-05-28T14:00:00.000Z"
		},
		{
			"title": "How to Keep Your Social Media Marketing Going While You’re on Vacation",
			"author": "Rohit Sharma",
			"content": "When social media is part of your business, then it become immensely difficult to decide whether to take off some time from work or not But, like any normal human being you also deserve to take some time off from work to get relaxed and re-focused. It is normal to have apprehensions about whether unplugging from social media would bring negative consequences to your business.However, if you think that you are the only one who is getting this weird thought to detox from social media, then you are not alone. In fact in a recent study conducted by eConsultancy proved that a large number of social media users occasionally cut off from this platform to feel relaxed.",
			"published": "2018-05-27T16:00:00.000Z"
		},
		{
			"title": "Introducing Slack Integration",
			"author": "Tushar Mahajan",
			"content": "Today we're happy to introduce Slack integration for our Business users! Now this will change the way Brands and Agencies can bring in their teams to collaborate in Social Publishing and Brand Monitoring right from their workspace. When you connect your Statusbrew with one or more Slack channels or workplaces, you would receive instant Slack notifications for all the activities you choose are important for your Business. Over last 2 months, we privately tested Slack for Statusbrew with 100 Brands and Agencies of Team sizes from 2 to 50. On an average Teams had to spend over 30% lesser time on their Publishing workflow and time to reply to their Social DMs & Mentions was reduced by about 60% for some brands. ",
			"published": "2018-05-10T00:00:00.000Z"
		},
		{
			"title": "How can you Generate 100 Leads a Week from Twitter",
			"author": "Ritika Sharma",
			"content": "With 330 million monthly active users, sending around 500 million tweets daily, Twitter is a powerful platform to get supporters, to share your ideas & thoughts and to reach your future customers and lifelong brand advocates.Twitter is fast unlike other social media platform, it shows tweets in real time. When you publish on it, the people following your business will receive the tweet immediately. But despite all this, there are times when you can't see positive outcomes from your Twitter advertising endeavors.Could it be that you’re not using a social media management tool that gives you tools to publish, connect, and report on Twitter? Let us tell you how Statusbrew raises the bar on Twitter marketing features for businesses and agencies. In this guide, we’ll show you how we utilize Twitter to generate 100 new leads every week, without much investment.But first, let us understand...",
			"published": "2018-02-13T00:00:00.000Z"
		},
		{
			"title": "How To Build Your Marketing Funnel For Sales Ready Leads",
			"author": "Sanchit Raina",
			"content": "Have you ever participated in a treasure hunt? Or even familiar with the basic idea of the whole thing? It’s amazing how people are so motivated to find a treasure about which they know nothing.You have a lot of incredible clues along the way and you have to go through a journey where you don’t know what is next. And at each step people are filtered until one person or team finds the treasure.Fun Fact: This is what google shows you when you search for a filter. Most of the results look quite similar to a funnel.",
			"published": "2018-01-02T00:00:00.000Z"
		},
		{
			"title": "5 Content Marketing Goals and their KPIs For Your Business",
			"author": "Mohamed Sikandar G",
			"content": "Now that Social Media is turned into a massive hall, Content Marketing has taken a smart transition into the online social world -- in the form of written posts on your corporate blogs, videos on YouTube, GIFs on Twitter and cat pictures on Instagram.All these content by businesses and brands aren’t created just for the sake of creating content. Each and every piece out there (even the 1941 Coca-Cola commercial) is supported by business goals, marketing objectives and KPIs.In order to create and measure your content effort, you need to know how to track the meaningful metric for a particular marketing objective.In this brief post, you are going to see what type of content can connect your audience and achieve your different marketing objectives,by focusing on various KPIs.",
			"published": "2017-12-14T00:00:00.000Z"
		},
		{
			"title": "A Brief And Easy Guide To Growth Hacking",
			"author": "Sanchit Rana",
			"content": "n the absence of big budgets and experienced marketing teams certain startups cracked the mystery of how to get people to use their service/product at that time.How did they do it?Growth Hacking!Rethinking marketing from the ground up, is what Growth Hacking can be called. It’s a term that came into being 7 years ago and since then these two words have made us rethink our whole approach to marketing because it is not marketing, well not purely.A definition for this would be : A creative and efficient technique to get more and meaningful users from a particular segment of the market rather than targeting everyone.",
			"published": "2017-10-03T00:00:00.000Z"
		},
		{
			"title": "Case Study: Timely, Japan",
			"author": "Mika Suzuki",
			"content": "Timely Ltd. was established in 2009 as a small Media Advertising company in Osaka, Japan. Fast forward to 2018, now they’re an Enterprise level Social Media Marketing Agency with the head branch office in Tokyo, besides regional branches in Osaka, Fukuoka, Kagawa, Kagoshima and Miyagi prefecture.Their ARR for 2017-18 was 19 Billion Yen.",
			"published": "2017-07-07T00:00:00.000Z"
		},
		{
			"title": "5 Twitter Hacks To Grow Your Followers",
			"author": "Mohamed Sikander G",
			"content": "Just be practical for a minute and accept that Twitter is a super amazing place to hang out on the internet because the flow of ideas and content just never stops. From my personal experience, I can tell you that it’s completely worth to spend some time to grow...",
			"published": "2017-05-15T14:00:00.000Z"
		},
		{
			"title": "Content Suggestions: Share Relevant Content From Within Statusbrew",
			"author": "Sanchit Raina",
			"content": "The Internet is huge! Thanks to Google and other search engines, it does not take us a lifetime to search something. Still, searching exactly something that you want to read or share, takes a considerable amount of time. To reduce this time even further, RSS was introduced. RSS solves this...",
			"published": "2017-03-27T16:00:00.000Z"
		},
		{
			"title": "6 Claves para construir tu Marca Personal",
			"author": "Valeria Vilchez",
			"content": "Hoy en día es indispensable construir tu marca personal. Se han ido los días de las personas que permanecen en un trabajo de 15 a 20 años. Tienes que ser un experto en algo. El trabajo más importante que tienes hoy es ser el presidente de tu propia marca. La...",
			"published": "2017-01-28T00:00:00.000Z"
		},
		{
			"title": "We’ve Updated To The New Twitter 280 Characters Limit",
			"author": "Amol Gupta",
			"content": "With today’s 'Tweeting Made Easier' update, Twitter has now doubled its posting limit to 280 characters. While this change has been the biggest for Twitter community ever since was launched back in 2006, Twitter users responded to the rollout withAll we wanted was an edit button...",
			"published": "2016-12-13T00:00:00.000Z"
		},
		{
			"title": "Why is Content Not Just Text?",
			"author": "Aman Chauhan",
			"content": "Gone are the days when the catchy headlines were enough for a writer to engage a reader for a plain text journal. In today’s era of eye-pleasing visuals and graphics, the text has turned out to be a mere custom of necessity. How so ever smart a content might...",
			"published": "2016-08-02T00:00:00.000Z"
		},
		{
			"title": "5 maneiras de promover o seu blog nas redes sociais",
			"author": "Gonzalo Martinez",
			"content": "5 maneiras de promover o seu blog nas redes sociais O blog é uma excelente maneira de expressar-se, escrever sobre suas paixões ou dedicar-se a um determinado nicho, como saúde e estilo de vida, fitness, etc. Há muitas maneiras de promover o seu blog nas redes sociais, e isso é...",
			"published": "2016-04-14T00:00:00.000Z"
		},
		{
			"title": "How To Become A LinkedIn Influencer",
			"author": "Mohamed Sikander G",
			"content": "Becoming an Influencer always first starts with becoming a professional. And when it comes to portraying yourself as a professional, a LinkedIn profile always works as a highlighter. LinkedIn is the world's biggest professional network with 500 million users from 200 countries. People are working hard to become a LinkedIn...",
			"published": "2016-02-03T00:00:00.000Z"
		}
	]
}